In [2]:
import pandas as pd

In [3]:
d1={'student':pd.Series([1,2,3,4,5,6])}
d1

{'student': 0    1
 1    2
 2    3
 3    4
 4    5
 5    6
 dtype: int64}

In [4]:
import pandas as pd

In [5]:
import pandas as pd
import numpy as np

d1={'customer_id':pd.Series([2,4,6,8]),
    'product':pd.Series(['oven','oven','oven','Television','Television','Television'])}

df1=pd.DataFrame(d1)

d2={'customer_id':pd.Series([2,4,6,8]),
   'State':pd.Series(['california','california','texas','texas'])}
df2=pd.DataFrame(d2)

In [6]:
d1

{'customer_id': 0    2
 1    4
 2    6
 3    8
 dtype: int64,
 'product': 0          oven
 1          oven
 2          oven
 3    Television
 4    Television
 5    Television
 dtype: object}

In [7]:
df1

   customer_id     product
0          2.0        oven
1          4.0        oven
2          6.0        oven
3          8.0  Television
4          NaN  Television
5          NaN  Television

In [8]:
d2

{'customer_id': 0    2
 1    4
 2    6
 3    8
 dtype: int64,
 'State': 0    california
 1    california
 2         texas
 3         texas
 dtype: object}

In [9]:
df2

   customer_id       State
0            2  california
1            4  california
2            6       texas
3            8       texas

# inner join pandas

In [10]:
pd.merge(df1,df2, on='customer_id', how='inner')

   customer_id     product       State
0          2.0        oven  california
1          4.0        oven  california
2          6.0        oven       texas
3          8.0  Television       texas

In [11]:
pd.merge(df1,df2, on='customer_id', how='outer')

   customer_id     product       State
0          2.0        oven  california
1          4.0        oven  california
2          6.0        oven       texas
3          8.0  Television       texas
4          NaN  Television         NaN
5          NaN  Television         NaN

In [12]:
pd.merge(df1,df2, on='customer_id', how='left') #left join in python

   customer_id     product       State
0          2.0        oven  california
1          4.0        oven  california
2          6.0        oven       texas
3          8.0  Television       texas
4          NaN  Television         NaN
5          NaN  Television         NaN

In [13]:
pd.merge(df1,df2, on='customer_id', how='right') #right join in python

   customer_id     product       State
0          2.0        oven  california
1          4.0        oven  california
2          6.0        oven       texas
3          8.0  Television       texas

In [14]:
d={'Name':['Alisha','bobby','cathrine','madonna','rocky','sebastian','jaqluine','rahul','']
    
}

In [15]:
d1={'customer_id':[1,2,3],'product':['oven','oven','television'],
   'state':['california','texas','georgia']}
d1

{'customer_id': [1, 2, 3],
 'product': ['oven', 'oven', 'television'],
 'state': ['california', 'texas', 'georgia']}

In [16]:
df1=pd.DataFrame(d1)
df1

   customer_id     product       state
0            1        oven  california
1            2        oven       texas
2            3  television     georgia

In [17]:
df1.columns

Index(['customer_id', 'product', 'state'], dtype='object')

In [20]:
d1=('cutomer_id':'[1,2,3]','product':'television')

SyntaxError: invalid syntax (2069957919.py, line 1)

In [52]:
df1.columns=['id','product_type','province']
df1

   id product_type    province
0   1         oven  california
1   2         oven       texas
2   3   television     georgia

In [53]:
df1=df1.rename(columns={'province':'city'})
df1

   id product_type        city
0   1         oven  california
1   2         oven       texas
2   3   television     georgia